# AutoCorrectAlmostVHLines Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BaseImportOptions..::..AutoCorrectAlmostVHLines Property
BaseImportOptions Class See Also
---
Correct almost-vertical lines and almost-horizontal lines for import model if option is set to true, the almost-vertical lines would be vertical lines and almost-horizontal lines would be horizontal lines.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool AutoCorrectAlmostVHLines { get; set; }
```

Visual Basic
---
```text
Public Property AutoCorrectAlmostVHLines As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool AutoCorrectAlmostVHLines {
	bool get ();
	void set (bool value);
}
```

# See Also
BaseImportOptions Class
Autodesk.Revit.DB Namespace